
class KiwoomRealTimeStockPrice:

    def __init__(self, kiwoom):
        """
        :param kiwoom: 키움 OpenAPI+ 인스턴스
        :param screen_number: 기본 화면번호
        """
        self.kiwoom = kiwoom
        self.screen_number = 2000
    
    def get_screen_no(self):
        """
        화면번호를 자동으로 증가시키는 함수.
        :return: 새로 할당된 화면번호 (문자열)
        """
        self.screen_no_counter += 1
        return str(self.screen_no_counter)


    def get_real_time_stock_price_info(self, code):
        """
        특정 종목 코드의 주요 시세 정보를 가져옵니다.
        :param code: 종목 코드
        """
        fid_map = {
            "현재가": 10,
            "전일대비": 11,
            "등락률": 12,
            "최우선매도호가": 27,
            "최우선매수호가": 28,
            "누적거래량" : 13,
            "누적거래대금": 14,
            "시가": 16,
            "고가": 17,
            "저가": 18,
            "전일대비기호" : 25,
            "전일거래량대비": 26,
            "거래대금증감": 29,
            "전일거래량대비": 30,
            "거래회전율": 31,
            "거래비용": 32,
            "시가총액": 311,
            "시가총액비중": 312,
            "상한가발생시간": 567,
            "하한가발생시간": 568
        }
            
        screen_no = self.get_screen_no()
        self.kiwoom.SetRealReg(screen_no, code, fid_map, "0")

    def get_real_time_stock_trade_info(self,code):
        """
        특정 종목 코드의 주식 체결정보를 가져옵니다.
        :param code: 종목 코드
        """
        fid_map = {
            "체결시간": 20,
            "현재가": 10,
            "전일대비": 11,
            "등락률": 12,
            "최우선매도호가" : 27,
            "최우선매수호가": 28,
            "거래량(+는 매수체결, -는 매도체결)": 15,
            "누적거래량": 13,
            "누적거래대금": 14,
            "시가": 16,
            "고가": 17,
            "저가": 18,
            "전일대비기호": 25,
            "전일거래량대비": 26,
            "거래대금증감" : 29,
            "전일거래량대비(비율)": 30,
            "거래회전율": 31,
            "거래비용": 32,
            "체결강도": 228,
            "시가총액": 311,
            "장구분" : 290,
            "KO접근도": 691,
            "상한가발생시간": 567,
            "하한가발생시간": 568,
            "전일 동시간 거래량 비율" : 851
        }
        screen_no = self.get_screen_no()
        self.kiwoom.SetRealReg(screen_no, code, fid_map, "0")
    
    def get_real_time_order_book_info(self,code):
        """
        특정 종목 코드의 주식 호가정보를 가져옵니다.
        :param code: 종목 코드
        """
        fid_map = {
            "호가시간" : 21,
            "매도호가1" : 41,
            "매도호가수량1" : 61,
            "매도호가직전대비1" : 81,
            "매수호가1" : 51,
            "매수호가수량1" : 71,
            "매수호가직전대비1" : 91,
            "매도호가2" : 42,
            "매도호가수량2" : 62,
            "매도호가직전대비2" : 82,
            "매수호가2" : 52,
            "매수호가수량2" : 72,
            "매수호가직전대비2" : 92,
            "매도호가3" : 43,
            "매도호가수량3" : 63,
            "매도호가직전대비3" : 83,
            "매수호가3" : 53,
            "매수호가수량3" : 73,
            "매수호가직전대비3" : 93,
            "매도호가4" : 44,
            "매도호가수량4" : 64,
            "매도호가직전대비4" : 84,
            "매수호가4" : 54,
            "매수호가수량4" : 74,
            "매수호가직전대비4" : 94,
            "매도호가5" : 45,
            "매도호가수량5" : 65,
            "매도호가직전대비5" : 85,
            "매수호가5" : 55,
            "매수호가수량5" : 75,
            "매수호가직전대비5" : 95,
            "매도호가6" : 46,
            "매도호가수량6" : 66,
            "매도호가직전대비6" : 86,
            "매수호가6" : 56,
            "매수호가수량6" : 76,
            "매수호가직전대비6" : 96,
            "매도호가7" : 47,
            "매도호가수량7" : 67,
            "매도호가직전대비7" : 87,
            "매수호가7" : 57,
            "매수호가수량7" : 77,
            "매수호가직전대비7" : 97,
            "매도호가8" : 48,
            "매도호가수량8" : 68,
            "매도호가직전대비8" : 88,
            "매수호가8" : 58,
            "매수호가수량8" : 78,
            "매수호가직전대비8" : 98,
            "매도호가9" : 49,
            "매도호가수량9" : 69,
            "매도호가직전대비9" : 89,
            "매수호가9" : 59,
            "매수호가수량9" : 79,
            "매수호가직전대비9" : 99,
            "매도호가10" : 50,
            "매도호가수량10" : 70,
            

        
        }
        screen_no = self.get_screen_no()
        self.kiwoom.SetRealReg(screen_no, code, fid_map, "0")


